Repository: Seth9976/dobutsu
Catalog: po/*.po
Languages: de, lv

source: Cannot play for %c
de: Kann nicht für %c spielen
lv: Nevar spēlēt priekš %c

source: Cannot parse strength: %s
de: Verstehe Spielstärke nicht: %s
lv: Pretinieka grūtības pakāpe ir dota nederīgā formātā: %s

source: Strength must be positive: %s
de: Spielstärke muss positiv sein: %s
lv: Grūtības pakāpei ir jābūt pozitīvai: %s

source: Loading tablebase...
de: Lade Tafelwerk...
lv: Lādēju tabulu...

source: done
de: fertig
lv: gatavs

source: Unknown error
de: Unbekannter Fehler
lv: Nepazīstama kļūda

source: Error (%s) : %s
de: Fehler (%s) : %s
lv: Kļūda (%s) : %s

source: invalid position
de: Ungültige Stellung
lv: Nederīga pozīcija

source: You win!
de: Du gewinnst!
lv: Tu uzvari!

source: Starting new game.
de: Starte neues Spiel.
lv: Sāku jaunu spēli.

source: Draw by threefold repetition.
de: Remis durch dreifache Stellungswiederholung.
lv: Neizšķirts dēļ trīskārša spēles stāvokļa atkārtojuma.

source: tablebase unavailable
de: Tafelwerk nicht verfügbar
lv: tabulas nav pieejamas

source: My %u. move is : %s
de: Mein %u. Zug ist : %s
lv: Mans %u. gājiens ir : %s

source: I win!
de: Ich gewinne!
lv: Es uzvaru!

source: Error reading command
de: Fehler beim Lesen des Befehls
lv: Kļūdas dēļ nevarēja ielasīt komandu

source: unknown command
de: unbekannter Befehl
lv: nepazīstama komanda

source: strength must be positive
de: Spielstärke muss positiv sein
lv: grūtības pakāpei ir jābūt pozitīvai

source: invalid strength
de: ungültige Spielstärke
lv: nederīga grūtības pakāpe

source: Nothing to undo.
de: Nichts zurückzunehmen.
lv: Nav ko atsaukt.

source: help print a list of commands hint print what the engine would play exit leave the program version print program version new start a new game undo undo previous move remove undo last two moves setup setup board with position string show board print the current board show setup print board as a position string show moves print possible moves show eval print position evaluation show lines print possible moves and their evaluations strength show/set engine strength both make engine play both players go make the engine play the colour that is on the move force set the engine to play neither colour verbose print the board after every move quiet do not print the board after every move
de: help Gib diese Hilfe aus hint Gib aus, was der Computer spielen würde exit Verlasse das Programm version Gib die Programmversion aus new Starte ein neues Spiel undo Nehme den letzten Zug zurück remove Nehme die letzten beiden Züge zurück setup Bau die angegebene Stellung auf show board Gib das Spielbrett aus show setup Gib die Stellung in Kurzschreibweise aus show moves Gib alle möglichen Züge aus show eval Gib eine Stellungsbewertung aus show lines Gib mögliche Züge und ihre Bewertungen aus strength Gib die Spielstärke aus oder ändere sie both Lass den Computer für beide Spieler spielen go Lass den Computer die Seite spielen, die gerade am Zug ist force Lass den Computer keine der beiden Seiten spielen verbose Gib das Spielbrett nach jedem Zug aus quiet Gib das Spielbrett nicht nach jedem Zug aus
lv: help izdod šo pozīciju hint izdod, ko šeit spēlētu dators exit izej no programmas version izdod programmas versiju new iesāc jaunu spēli undo atsauc pēdējo gājienu remove atsauc pēdējos divus gājienus setup ielasi doto īsformāta spēles stāvokli show board izdod spēles laukumu show setup izdod spēles stāvokli īsformātā show moves izdod visus iespējamos gājienus show eval izdod spēles stāvokli un tā novērtējumu show lines izdod iespējamos gājienus un to novērtējumus strength izdod grūtības pakāpi vai izmaini to both atļauj datoram spēlēt abus spēlētājus go atļauj datoram spēlēt spēlētāju, kurš ir klāt force aizliedz datoram spēlēt jebkuru no abiem spēlētājiem verbose izdod spēles laukumu pēc katra gājiena quiet neizdod spēles laukumu pēc katra gājiena

source: All rights reserved.
de: Alle Rechte vorbehalten.
lv: Visas tiesības aizsargātas.

source: strength was reduced to maximum strength %f.
de: Spielstärke wurde auf das Maximum (%f) reduziert.
